{
  "items": [
    {
      "key": "aws",
      "name": "Amazon Web Services",
      "icon": "cib:amazon-aws",
      "color": "#FF9900",
      "description": {
        "pt": "Plataforma de serviços em nuvem para hospedar, escalar e gerenciar aplicações de forma segura e confiável.",
        "en": "Cloud services platform for securely and reliably hosting, scaling, and managing applications."
      }
    },
    {
      "key": "typescript",
      "name": "Typescript",
      "icon": "logos:typescript-icon",
      "color": "#3178C6",
      "description": {
        "pt": "Superset do JavaScript que adiciona tipagem estática, aumentando a produtividade e a manutenção de projetos.",
        "en": "JavaScript superset that adds static typing, improving productivity and project maintainability."
      }
    },
    {
      "key": "figma",
      "name": "Figma",
      "icon": "material-icon-theme:figma",
      "color": "#7C4DFF",
      "description": {
        "pt": "Ferramenta de design colaborativo para criar protótipos, interfaces e fluxos de usuário.",
        "en": "Collaborative design tool for creating prototypes, interfaces, and user flows."
      }
    },
    {
      "key": "serverless",
      "name": "Serverless",
      "icon": "material-icon-theme:serverless",
      "color": "#EF5350",
      "description": {
        "pt": "Arquitetura que permite rodar funções na nuvem sem gerenciar servidores, pagando apenas pelo uso.",
        "en": "Architecture that allows running functions in the cloud without managing servers, paying only for usage."
      }
    },
    {
      "key": "nextjs",
      "name": "Next.js",
      "icon": "devicon:nextjs",
      "color": "#000000",
      "description": {
        "pt": "Framework React que oferece renderização híbrida (SSR/SSG), rotas otimizadas e excelente performance.",
        "en": "React framework offering hybrid rendering (SSR/SSG), optimized routing, and excellent performance."
      }
    },
    {
      "key": "javascript",
      "name": "JavaScript",
      "icon": "devicon:javascript",
      "color": "#F0DB4F",
      "description": {
        "pt": "Linguagem de programação essencial para desenvolvimento web, tanto no frontend quanto no backend.",
        "en": "Essential programming language for web development, both frontend and backend."
      }
    },
    {
      "key": "tailwindcss",
      "name": "TailwindCSS",
      "icon": "material-icon-theme:tailwindcss",
      "color": "#4DB6AC",
      "description": {
        "pt": "Framework CSS utilitário que permite criar interfaces rápidas e responsivas com produtividade.",
        "en": "Utility-first CSS framework for building fast and responsive interfaces with high productivity."
      }
    },
    {
      "key": "reactnative",
      "name": "React Native",
      "icon": "devicon:reactnative",
      "color": "#61DAFB",
      "description": {
        "pt": "Framework para desenvolvimento de aplicativos móveis nativos utilizando React.",
        "en": "Framework for building native mobile apps using React."
      }
    },
    {
      "key": "docker",
      "name": "Docker",
      "icon": "material-icon-theme:docker",
      "color": "#0288D1",
      "description": {
        "pt": "Plataforma de containers que facilita a criação, deploy e execução de aplicações de forma padronizada.",
        "en": "Container platform that simplifies creating, deploying, and running applications in a standardized way."
      }
    },
    {
      "key": "nodejs",
      "name": "Nodejs",
      "icon": "material-icon-theme:nodejs",
      "color": "#8BC34A",
      "description": {
        "pt": "Ambiente de execução do JavaScript no backend, eficiente para aplicações escaláveis.",
        "en": "JavaScript runtime for backend, efficient for scalable applications."
      }
    },
    {
      "key": "postgresql",
      "name": "PostgreSQL",
      "icon": "devicon:postgresql",
      "color": "#336791",
      "description": {
        "pt": "Banco de dados relacional robusto, com suporte a consultas avançadas e alta confiabilidade.",
        "en": "Robust relational database with support for advanced queries and high reliability."
      }
    },
    {
      "key": "jest",
      "name": "Jest",
      "icon": "logos:jest",
      "color": "#99425B",
      "description": {
        "pt": "Framework de testes em JavaScript focado em simplicidade e rapidez, muito usado em projetos React e Node.js.",
        "en": "JavaScript testing framework focused on simplicity and speed, widely used in React and Node.js projects."
      }
    },
    {
      "key": "firebase",
      "name": "Firebase",
      "icon": "devicon:firebase",
      "color": "#F57C00",
      "description": {
        "pt": "Plataforma do Google que oferece serviços backend prontos, como autenticação, banco de dados e hospedagem.",
        "en": "Google platform offering ready-to-use backend services like authentication, database, and hosting."
      }
    },
    {
      "key": "react",
      "name": "React",
      "icon": "material-icon-theme:react",
      "color": "#00BCD4",
      "description": {
        "pt": "Biblioteca JavaScript para construção de interfaces de usuário modernas e componentizadas.",
        "en": "JavaScript library for building modern, component-based user interfaces."
      }
    }
  ]
}